
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 10 to destroy.</code></pre>

* Update
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]
* Delete
  * module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Replace
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name/9b8edb900e884efdaab3d8bfac290139" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-name/versions/9b8edb900e884efdaab3d8bfac290139" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "9b8edb900e884efdaab3d8bfac290139" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password/9e7630bb6d3b4c93824724c6b4c6a5d3" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-password/versions/9e7630bb6d3b4c93824724c6b4c6a5d3" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "9e7630bb6d3b4c93824724c6b4c6a5d3" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_action_group.db-alerts-action-group[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      - enabled             = true -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
      - location            = "global" -> null
      - name                = "cft-task-postgres-db-flexible-wa-support" -> null
      - resource_group_name = "cft-task-postgres-db-flexible-data-prod" -> null
      - short_name          = "cft-task-pos" -> null
      - tags                = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null

      - email_receiver {
          - email_address           = (sensitive value) -> null
          - name                    = "Email Receiver" -> null
          - use_common_alert_schema = true -> null
        }
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the cpu utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-prod" -> null
      - name                     = "db_cpu_percent_cft-task-postgres-db-flexible-prod" -> null
      - resource_group_name      = "cft-task-postgres-db-flexible-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "cpu_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the memory utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-prod" -> null
      - name                     = "db_memory_percent_cft-task-postgres-db-flexible-prod" -> null
      - resource_group_name      = "cft-task-postgres-db-flexible-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "memory_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.wa_task_management_api_database_flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the storage utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-prod" -> null
      - name                     = "db_storage_utilization_cft-task-postgres-db-flexible-prod" -> null
      - resource_group_name      = "cft-task-postgres-db-flexible-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "storage_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-prod"
        name                              = "cft-task-postgres-db-flexible-prod"
      ~ tags                              = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-data-prod"
        name       = "cft-task-postgres-db-flexible-data-prod"
      ~ tags       = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_action_group.db-alerts-action-group[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      - enabled             = true -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
      - location            = "global" -> null
      - name                = "cft-task-postgres-db-flexible-wa-support" -> null
      - resource_group_name = "cft-task-postgres-db-flexible-replica-data-prod" -> null
      - short_name          = "cft-task-pos" -> null
      - tags                = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null

      - email_receiver {
          - email_address           = (sensitive value) -> null
          - name                    = "Email Receiver" -> null
          - use_common_alert_schema = true -> null
        }
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_cpu[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the cpu utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_cft-task-postgres-db-flexible-replica-prod" -> null
      - name                     = "db_cpu_percent_cft-task-postgres-db-flexible-replica-prod" -> null
      - resource_group_name      = "cft-task-postgres-db-flexible-replica-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "cpu_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_memory[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the memory utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_cft-task-postgres-db-flexible-replica-prod" -> null
      - name                     = "db_memory_percent_cft-task-postgres-db-flexible-replica-prod" -> null
      - resource_group_name      = "cft-task-postgres-db-flexible-replica-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "memory_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the storage utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_cft-task-postgres-db-flexible-replica-prod" -> null
      - name                     = "db_storage_utilization_cft-task-postgres-db-flexible-replica-prod" -> null
      - resource_group_name      = "cft-task-postgres-db-flexible-replica-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.Insights/actionGroups/cft-task-postgres-db-flexible-wa-support" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "storage_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-prod"
        name                              = "cft-task-postgres-db-flexible-replica-prod"
      ~ tags                              = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cft-task-postgres-db-flexible-replica-data-prod"
        name       = "cft-task-postgres-db-flexible-replica-data-prod"
      ~ tags       = {
          - "application"         = "task-management"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-03-28T17:39:50Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 10 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1410,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->